c5/src/InformationRegisters/Rights/Rights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Rights</name>
  <resources>
    <name>Access</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </resources>
  <resources>
    <name>Expiration</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Target</name>
    <type>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Action</name>
    <type>
      <types>EnumRef.AccessRights</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>CatalogRef.Metadata</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DateStart</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Method</name>
    <type>
      <types>EnumRef.RestrictionMethods</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/RestrictionMethods/RestrictionMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RestrictionMethods</name>
  <enumValues>
    <name>Period</name>
  </enumValues>
  <enumValues>
    <name>Duration</name>
  </enumValues>
</mdclass:Enum>

c5/src/InformationRegisters/Rights/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Record.SourceRecordKey.IsEmpty () ) then
		fillNew ();
	else
		if ( not InformationRegisters.Rights.Allowed ( Record.Target ) ) then
			Cancel = true;
			return;
		endif; 
	endif; 
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|DateStart DateEnd enable Record.Method = Enum.RestrictionMethods.Period;
	|Duration enable Record.Method = Enum.RestrictionMethods.Duration
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	Record.Creator = SessionParameters.User;
	
EndProcedure 

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	adjustTarget ( CurrentObject );
	if ( not InformationRegisters.Rights.Allowed ( Record.Target ) ) then
		Cancel = true;
	endif; 
	
EndProcedure

&AtServer
Procedure adjustTarget ( CurrentObject )
	
	if ( not ValueIsFilled ( CurrentObject.Target ) ) then
		CurrentObject.Target = undefined;
	endif; 
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure MethodOnChange ( Item )
	
	reset ();
	Appearance.Apply ( ThisObject, "Record.Method" );
	
EndProcedure

&AtClient
Procedure reset ()
	
	if ( Record.Method = PredefinedValue ( "Enum.RestrictionMethods.Period" ) ) then
		Record.Duration = 0;
	else
		Record.DateStart = undefined;
		Record.DateEnd = undefined;
	endif; 
	
EndProcedure
